jurgen-kluft/rlcd/source/lib_display/cpp/databus/databus_ESP32SPI.cpp
/*
 * start rewrite from:
 * https://github.com/espressif/arduino-esp32.git
 */
#include "lib_display/databus/databus_ESP32SPI.h"

#if defined(ESP32) && (CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C2 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || \
                       CONFIG_IDF_TARGET_ESP32C5)

struct spi_struct_t
{
    volatile spi_dev_t *dev;
    #if !CONFIG_DISABLE_HAL_LOCKS
    SemaphoreHandle_t lock;
    #endif
    uint8_t num;
    int8_t  sck;
    int8_t  miso;
    int8_t  mosi;
    int8_t  ss;
    bool    ss_invert;
};

    #if CONFIG_DISABLE_HAL_LOCKS
        #define SPI_MUTEX_LOCK()
        #define SPI_MUTEX_UNLOCK()
// clang-format off
static spi_t _spi_bus_array[] = {
#if CONFIG_IDF_TARGET_ESP32S2 ||CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32P4
  {(volatile spi_dev_t *)(DR_REG_SPI2_BASE), 0, -1, -1, -1, -1, false},
  {(volatile spi_dev_t *)(DR_REG_SPI3_BASE), 1, -1, -1, -1, -1, false}
#elif CONFIG_IDF_TARGET_ESP32C2
  {(volatile spi_dev_t *)(DR_REG_SPI2_BASE), 0, -1, -1, -1, -1, false}
#elif CONFIG_IDF_TARGET_ESP32C3
  {(volatile spi_dev_t *)(DR_REG_SPI2_BASE), 0, -1, -1, -1, -1, false}
#elif CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32C5
  {(spi_dev_t *)(DR_REG_SPI2_BASE), 0, -1, -1, -1, -1, false}
#else
  {(volatile spi_dev_t *)(DR_REG_SPI0_BASE), 0, -1, -1, -1, -1, false},
  {(volatile spi_dev_t *)(DR_REG_SPI1_BASE), 1, -1, -1, -1, -1, false},
  {(volatile spi_dev_t *)(DR_REG_SPI2_BASE), 2, -1, -1, -1, -1, false},
  {(volatile spi_dev_t *)(DR_REG_SPI3_BASE), 3, -1, -1, -1, -1, false}
#endif
};
    // clang-format on
    #else
        #define SPI_MUTEX_LOCK() \
            do                   \
            {                    \
            } while (xSemaphoreTake(_spi->lock, portMAX_DELAY) != pdPASS)
        #define SPI_MUTEX_UNLOCK() xSemaphoreGive(_spi->lock)

static spi_t _spi_bus_array[] = {
        #if CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32P4
  {(volatile spi_dev_t *)(DR_REG_SPI2_BASE), NULL, 0, -1, -1, -1, -1, false},
  {(volatile spi_dev_t *)(DR_REG_SPI3_BASE), NULL, 1, -1, -1, -1, -1, false}
        #elif CONFIG_IDF_TARGET_ESP32C2
  {(volatile spi_dev_t *)(DR_REG_SPI2_BASE), NULL, 0, -1, -1, -1, -1, false}
        #elif CONFIG_IDF_TARGET_ESP32C3
  {(volatile spi_dev_t *)(DR_REG_SPI2_BASE), NULL, 0, -1, -1, -1, -1, false}
        #elif CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32C5
  {(spi_dev_t *)(DR_REG_SPI2_BASE), NULL, 0, -1, -1, -1, -1, false}
        #else
  {(volatile spi_dev_t *)(DR_REG_SPI0_BASE), NULL, 0, -1, -1, -1, -1, false},
  {(volatile spi_dev_t *)(DR_REG_SPI1_BASE), NULL, 1, -1, -1, -1, -1, false},
  {(volatile spi_dev_t *)(DR_REG_SPI2_BASE), NULL, 2, -1, -1, -1, -1, false},
  {(volatile spi_dev_t *)(DR_REG_SPI3_BASE), NULL, 3, -1, -1, -1, -1, false}
        #endif
};
    #endif

/**
 * @brief Arduino_ESP32SPI
 *
 */
Arduino_ESP32SPI::Arduino_ESP32SPI(int8_t dc /* = GFX_NOT_DEFINED */, int8_t cs /* = GFX_NOT_DEFINED */, int8_t sck /* = GFX_NOT_DEFINED */, int8_t mosi /* = GFX_NOT_DEFINED */, int8_t miso /* = GFX_NOT_DEFINED */,
                                   uint8_t _spi_num /* = VSPI for ESP32, HSPI for S2 & S3, FSPI for C3 */, bool is_shared_interface /* = true */)
    : _dc(dc)
    , _spi_num(_spi_num)
    , _is_shared_interface(is_shared_interface)
{
    #if CONFIG_IDF_TARGET_ESP32
    if (sck == GFX_NOT_DEFINED && miso == GFX_NOT_DEFINED && mosi == GFX_NOT_DEFINED && cs == GFX_NOT_DEFINED)
    {
        _sck  = (_spi_num == VSPI) ? SCK : 14;
        _miso = (_spi_num == VSPI) ? MISO : 12;
        _mosi = (_spi_num == VSPI) ? MOSI : 13;
        _cs   = (_spi_num == VSPI) ? SS : 15;
    }
    else
    {
        _sck  = sck;
        _miso = miso;
        _mosi = mosi;
        _cs   = cs;
    }
    #else
    if (sck == GFX_NOT_DEFINED && miso == GFX_NOT_DEFINED && mosi == GFX_NOT_DEFINED && cs == GFX_NOT_DEFINED)
    {
        _sck  = SCK;
        _miso = MISO;
        _mosi = MOSI;
        _cs   = SS;
    }
    else
    {
        _sck  = sck;
        _miso = miso;
        _mosi = mosi;
        _cs   = cs;
    }
    #endif
}

static void _on_apb_change(void *arg, apb_change_ev_t ev_type, uint32_t old_apb, uint32_t new_apb)
{
    spi_t *_spi = (spi_t *)arg;
    if (ev_type == APB_BEFORE_CHANGE)
    {
        SPI_MUTEX_LOCK();
        while (_spi->dev->cmd.usr)
            ;
    }
    else
    {
        // Fix for ESP32 Arduino core 3.3.6+ compatibility
        // Ref: https://github.com/espressif/arduino-esp32/pull/12265
        // Changed: spiFrequencyToClockDiv(freq) -> spiFrequencyToClockDiv(spi, freq)
    #if defined(ESP_ARDUINO_VERSION) && (ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 3, 6))
        _spi->dev->clock.val = spiFrequencyToClockDiv(_spi, old_apb / ((_spi->dev->clock.clkdiv_pre + 1) * (_spi->dev->clock.clkcnt_n + 1)));
    #else
        _spi->dev->clock.val = spiFrequencyToClockDiv(old_apb / ((_spi->dev->clock.clkdiv_pre + 1) * (_spi->dev->clock.clkcnt_n + 1)));
    #endif
        SPI_MUTEX_UNLOCK();
    }
}

static void spiInitBus(spi_t *spi)
{
    #if CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32
    spi->dev->slave.trans_done = 0;
    #endif
    spi->dev->slave.val = 0;
    #if CONFIG_IDF_TARGET_ESP32
    spi->dev->pin.val = 0;
    #else
    spi->dev->misc.val = 0;
    #endif
    spi->dev->user.val  = 0;
    spi->dev->user1.val = 0;
    spi->dev->ctrl.val  = 0;
    #if CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32
    spi->dev->ctrl1.val = 0;
    spi->dev->ctrl2.val = 0;
    #else
    spi->dev->clk_gate.val           = 0;
    spi->dev->dma_conf.val           = 0;
    spi->dev->dma_conf.rx_afifo_rst  = 1;
    spi->dev->dma_conf.buf_afifo_rst = 1;
    #endif
    spi->dev->clock.val = 0;
}

/**
 * @brief begin
 *
 * @param speed
 * @param dataMode
 * @return true
 * @return false
 */
bool Arduino_ESP32SPI::begin(int32_t speed, int8_t dataMode)
{
    // set SPI parameters
    _speed    = (speed == GFX_NOT_DEFINED) ? SPI_DEFAULT_FREQ : speed;
    _dataMode = (dataMode == GFX_NOT_DEFINED) ? SPI_MODE0 : dataMode;

    if (!_div)
    {
        // Fix for ESP32 Arduino core 3.3.6+ compatibility
        // Ref: https://github.com/espressif/arduino-esp32/pull/12265
        // Changed: spiFrequencyToClockDiv(freq) -> spiFrequencyToClockDiv(spi, freq)
    #if defined(ESP_ARDUINO_VERSION) && (ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 3, 6))
        _div = spiFrequencyToClockDiv(&_spi_bus_array[_spi_num], _speed);
    #else
        _div = spiFrequencyToClockDiv(_speed);
    #endif
    }

    // set pin mode
    if (_dc != GFX_NOT_DEFINED)
    {
        pinMode(_dc, OUTPUT);
        digitalWrite(_dc, HIGH);  // Data mode
    }
    if (_cs != GFX_NOT_DEFINED)
    {
        pinMode(_cs, OUTPUT);
        digitalWrite(_cs, HIGH);  // disable chip select
    }

