jurgen-kluft/rlcd/source/lib_display/cpp/databus/databus_ESP32SPI.cpp
    #if (CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5)
    // set fastIO variables
    if (_dc >= 32)
    {
        _dcPinMask = digitalPinToBitMask(_dc);
        _dcPortSet = (PORTreg_t)GPIO_OUT1_W1TS_REG;
        _dcPortClr = (PORTreg_t)GPIO_OUT1_W1TC_REG;
    }
    else if (_dc != GFX_NOT_DEFINED)
    {
        _dcPinMask = digitalPinToBitMask(_dc);
        _dcPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
        _dcPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    }
    #else
    if (_dc != GFX_NOT_DEFINED)
    {
        _dcPinMask = digitalPinToBitMask(_dc);
        _dcPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
        _dcPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    }
    #endif

    #if (CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5)
    if (_cs >= 32)
    {
        _csPinMask = digitalPinToBitMask(_cs);
        _csPortSet = (PORTreg_t)GPIO_OUT1_W1TS_REG;
        _csPortClr = (PORTreg_t)GPIO_OUT1_W1TC_REG;
    }
    else if (_cs != GFX_NOT_DEFINED)
    {
        _csPinMask = digitalPinToBitMask(_cs);
        _csPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
        _csPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    }
    #else
    if (_cs != GFX_NOT_DEFINED)
    {
        _csPinMask = digitalPinToBitMask(_cs);
        _csPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
        _csPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    }
    #endif

    // SPI.begin(_sck, _miso, _mosi);
    // _spi = spiStartBus(_spi_num, _div, SPI_MODE0, SPI_MSBFIRST);
    _spi = &_spi_bus_array[_spi_num];

    #if !CONFIG_DISABLE_HAL_LOCKS
    if (_spi->lock == NULL)
    {
        _spi->lock = xSemaphoreCreateMutex();
    }
    #endif

    #if CONFIG_IDF_TARGET_ESP32S2
    if (_spi_num == FSPI)
    {
        DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, DPORT_SPI2_CLK_EN);
        DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_SPI2_RST);
    }
    else if (_spi_num == HSPI)
    {
        DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, DPORT_SPI3_CLK_EN);
        DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_SPI3_RST);
    }
    #elif CONFIG_IDF_TARGET_ESP32S3
    if (_spi_num == FSPI)
    {
        periph_ll_reset(PERIPH_SPI2_MODULE);
        periph_ll_enable_clk_clear_rst(PERIPH_SPI2_MODULE);
    }
    else if (_spi_num == HSPI)
    {
        periph_ll_reset(PERIPH_SPI3_MODULE);
        periph_ll_enable_clk_clear_rst(PERIPH_SPI3_MODULE);
    }
    #elif CONFIG_IDF_TARGET_ESP32
    if (_spi_num == HSPI)
    {
        DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, DPORT_SPI2_CLK_EN);
        DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_SPI2_RST);
    }
    else if (_spi_num == VSPI)
    {
        DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, DPORT_SPI3_CLK_EN);
        DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_SPI3_RST);
    }
    else
    {
        DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, DPORT_SPI01_CLK_EN);
        DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_SPI01_RST);
    }
    #elif CONFIG_IDF_TARGET_ESP32P4
        #pragma GCC diagnostic push
        #pragma GCC diagnostic ignored "-Wunused-variable"
    if (_spi_num == FSPI)
    {
        PERIPH_RCC_ACQUIRE_ATOMIC(PERIPH_GPSPI2_MODULE, ref_count)
        {
            if (ref_count == 0)
            {
                PERIPH_RCC_ATOMIC()
                {
                    spi_ll_enable_bus_clock(SPI2_HOST, true);
                    spi_ll_reset_register(SPI2_HOST);
                    spi_ll_enable_clock(SPI2_HOST, true);
                }
            }
        }
    }
    else if (_spi_num == HSPI)
    {
        PERIPH_RCC_ACQUIRE_ATOMIC(PERIPH_GPSPI3_MODULE, ref_count)
        {
            if (ref_count == 0)
            {
                PERIPH_RCC_ATOMIC()
                {
                    spi_ll_enable_bus_clock(SPI3_HOST, true);
                    spi_ll_reset_register(SPI3_HOST);
                    spi_ll_enable_clock(SPI3_HOST, true);
                }
            }
        }
    }
        #pragma GCC diagnostic pop
    #elif defined(__PERIPH_CTRL_ALLOW_LEGACY_API)
    periph_ll_reset(PERIPH_SPI2_MODULE);
    periph_ll_enable_clk_clear_rst(PERIPH_SPI2_MODULE);
    #endif

    SPI_MUTEX_LOCK();
    spiInitBus(_spi);
    #if CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32S3
    _spi->dev->clk_gate.clk_en              = 1;
    _spi->dev->clk_gate.mst_clk_sel         = 1;
    _spi->dev->clk_gate.mst_clk_active      = 1;
    _spi->dev->dma_conf.tx_seg_trans_clr_en = 1;
    _spi->dev->dma_conf.rx_seg_trans_clr_en = 1;
    _spi->dev->dma_conf.dma_seg_trans_en    = 0;
    #endif
    _spi->dev->user.usr_mosi = 1;
    if (_miso == GFX_NOT_DEFINED)
    {
        _spi->dev->user.usr_miso = 0;
        _spi->dev->user.doutdin  = 0;
    }
    else
    {
        _spi->dev->user.usr_miso = 1;
        _spi->dev->user.doutdin  = 1;
    }

    for (uint8_t i = 0; i < 16; i++)
    {
    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
        _spi->dev->data_buf[i].val = 0x00000000;
    #else
        _spi->dev->data_buf[i] = 0x00000000;
    #endif
    }
    SPI_MUTEX_UNLOCK();

    spiSetDataMode(_spi, _dataMode);
    spiSetBitOrder(_spi, _bitOrder);
    spiSetClockDiv(_spi, _div);

    addApbChangeCallback(_spi, _on_apb_change);

    spiAttachSCK(_spi, _sck);

    if (_miso != GFX_NOT_DEFINED)
    {
        spiAttachMISO(_spi, _miso);
    }

    spiAttachMOSI(_spi, _mosi);

    if (!_is_shared_interface)
    {
        spiTransaction(_spi, _div, _dataMode, _bitOrder);
    }

    _buffer = (uint8_t *)heap_caps_aligned_alloc(16, ESP32SPI_MAX_PIXELS_AT_ONCE * 2, MALLOC_CAP_DMA);
    if (!_buffer)
    {
        return false;
    }

    return true;
}

/**
 * @brief beginWrite
 *
 */
void Arduino_ESP32SPI::beginWrite()
{
    _data_buf_bit_idx = 0;
    _buffer[0]        = 0;

