jurgen-kluft/rlcd/source/lib_display/cpp/databus/databus_ESP32SPI.cpp
    if (_is_shared_interface)
    {
        spiTransaction(_spi, _div, _dataMode, _bitOrder);
    }

    if (_dc != GFX_NOT_DEFINED)
    {
        DC_HIGH();
    }
    CS_LOW();
}

/**
 * @brief endWrite
 *
 */
void Arduino_ESP32SPI::endWrite()
{
    if (_data_buf_bit_idx > 0)
    {
        flush_data_buf();
    }

    if (_is_shared_interface)
    {
        spiEndTransaction(_spi);
    }

    CS_HIGH();
}

/**
 * @brief writeCommand
 *
 * @param c
 */
void Arduino_ESP32SPI::writeCommand(uint8_t c)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        WRITE9BIT(c);
    }
    else
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        DC_LOW();

    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
        _spi->dev->data_buf[0].val = c;
    #else
        _spi->dev->data_buf[0] = c;
    #endif
        POLL(7);

        DC_HIGH();
    }
}

/**
 * @brief writeCommand16
 *
 * @param c
 */
void Arduino_ESP32SPI::writeCommand16(uint16_t c)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        _data16.value = c;
        WRITE9BIT(_data16.msb);
        WRITE9BIT(_data16.lsb);
    }
    else
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        DC_LOW();

    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
        MSB_16_SET(_spi->dev->data_buf[0].val, c);
    #else
        MSB_16_SET(_spi->dev->data_buf[0], c);
    #endif
        POLL(15);

        DC_HIGH();
    }
}

/**
 * @brief
 *
 * @param data
 * @param len
 */
void Arduino_ESP32SPI::writeCommandBytes(uint8_t *data, uint32_t len)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        while (len--)
        {
            WRITE9BIT(*data++);
        }
    }
    else
    {
        DC_LOW();

        while (len--)
        {
            WRITE8BIT(*data++);
        }

        DC_HIGH();
    }
}

/**
 * @brief write
 *
 * @param d
 */
void Arduino_ESP32SPI::write(uint8_t d)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        WRITE9BIT(0x100 | d);
    }
    else
    {
        WRITE8BIT(d);
    }
}

/**
 * @brief write16
 *
 * @param d
 */
void Arduino_ESP32SPI::write16(uint16_t d)
{
    _data16.value = d;
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        WRITE9BIT(0x100 | _data16.msb);
        WRITE9BIT(0x100 | _data16.lsb);
    }
    else
    {
        WRITE8BIT(_data16.msb);
        WRITE8BIT(_data16.lsb);
    }
}

/**
 * @brief writeC8D8
 *
 * @param c
 * @param d
 */
void Arduino_ESP32SPI::writeC8D8(uint8_t c, uint8_t d)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        WRITE9BIT(c);
        WRITE9BIT(0x100 | d);
    }
    else
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        DC_LOW();

    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
        _spi->dev->data_buf[0].val = c;
    #else
        _spi->dev->data_buf[0] = c;
    #endif
        POLL(7);

        DC_HIGH();

    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
        _spi->dev->data_buf[0].val = d;
    #else
        _spi->dev->data_buf[0] = d;
    #endif
        POLL(7);
    }
}

/**
 * @brief writeC8D16
 *
 * @param c
 * @param d
 */
void Arduino_ESP32SPI::writeC8D16(uint8_t c, uint16_t d)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        WRITE9BIT(c);
        _data16.value = d;
        WRITE9BIT(0x100 | _data16.msb);
        WRITE9BIT(0x100 | _data16.lsb);
    }
    else
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        DC_LOW();

    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
        _spi->dev->data_buf[0].val = c;
    #else
        _spi->dev->data_buf[0] = c;
    #endif
        POLL(7);

        DC_HIGH();

    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
        MSB_16_SET(_spi->dev->data_buf[0].val, d);
    #else
        MSB_16_SET(_spi->dev->data_buf[0], d);
    #endif
        POLL(15);
    }
}

/**
 * @brief writeC8D16D16
 *
 * @param c
 * @param d1
 * @param d2
 */
void Arduino_ESP32SPI::writeC8D16D16(uint8_t c, uint16_t d1, uint16_t d2)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        WRITE9BIT(c);
        _data16.value = d1;
        WRITE9BIT(0x100 | _data16.msb);
        WRITE9BIT(0x100 | _data16.lsb);
        _data16.value = d2;
        WRITE9BIT(0x100 | _data16.msb);
        WRITE9BIT(0x100 | _data16.lsb);
    }
    else
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        DC_LOW();

    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
        _spi->dev->data_buf[0].val = c;
    #else
        _spi->dev->data_buf[0] = c;
    #endif
        POLL(7);

        DC_HIGH();

    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
        MSB_32_16_16_SET(_spi->dev->data_buf[0].val, d1, d2);
    #else
        MSB_32_16_16_SET(_spi->dev->data_buf[0], d1, d2);
    #endif
        POLL(31);
    }
}

/**
 * @brief writeRepeat
 *
 * @param p
 * @param len
 */
void Arduino_ESP32SPI::writeRepeat(uint16_t p, uint32_t len)
{
    if (_data_buf_bit_idx > 0)
    {
        flush_data_buf();
    }

    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        _data16.value = p;
        uint32_t hi   = 0x100 | _data16.msb;
        uint32_t lo   = 0x100 | _data16.lsb;
        uint16_t idx;
        uint8_t  shift;
        uint32_t l;
        uint16_t bufLen = (len <= 28) ? len : 28;
        int16_t  xferLen;
        for (uint32_t t = 0; t < bufLen; t++)
        {
            idx   = _data_buf_bit_idx >> 3;
            shift = (_data_buf_bit_idx % 8);
            if (shift)
            {
                _buffer[idx++] |= hi >> (shift + 1);
                _buffer[idx] = hi << (7 - shift);
            }
            else
            {
                _buffer[idx++] = hi >> 1;
                _buffer[idx]   = hi << 7;
            }
            _data_buf_bit_idx += 9;

            idx   = _data_buf_bit_idx >> 3;
            shift = (_data_buf_bit_idx % 8);
            if (shift)
            {
                _buffer[idx++] |= lo >> (shift + 1);
                _buffer[idx] = lo << (7 - shift);
            }
            else
            {
                _buffer[idx++] = lo >> 1;
                _buffer[idx]   = lo << 7;
            }
            _data_buf_bit_idx += 9;
        }

        if (_miso == GFX_NOT_DEFINED)
        {
            l = (_data_buf_bit_idx + 31) / 32;
            for (uint32_t i = 0; i < l; i++)
            {
    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
                _spi->dev->data_buf[i].val = _buffer32[i];
    #else
                _spi->dev->data_buf[i] = _buffer32[i];
    #endif
            }
        }

