jurgen-kluft/rlcd/source/lib_display/cpp/databus/databus_ESP32SPI.cpp
        // Issue pixels in blocks from temp buffer
        while (len)  // While pixels remain
        {
            xferLen           = (bufLen < len) ? bufLen : len;  // How many this pass?
            _data_buf_bit_idx = xferLen * 18;

            if (_miso != GFX_NOT_DEFINED)
            {
                l = (_data_buf_bit_idx + 31) / 32;
                for (uint32_t i = 0; i < l; i++)
                {
    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
                    _spi->dev->data_buf[i].val = _buffer32[i];
    #else
                    _spi->dev->data_buf[i] = _buffer32[i];
    #endif
                }
            }
            POLL(_data_buf_bit_idx - 1);

            len -= xferLen;
        }
    }
    else  // 8-bit SPI
    {
        uint16_t bufLen = (len >= ESP32SPI_MAX_PIXELS_AT_ONCE) ? ESP32SPI_MAX_PIXELS_AT_ONCE : len;
        int16_t  xferLen, l;
        uint32_t c32;
        MSB_32_16_16_SET(c32, p, p);

        l = (bufLen + 1) / 2;
        if (_miso == GFX_NOT_DEFINED)
        {
            l = (bufLen + 1) >> 1;
            for (uint32_t i = 0; i < l; i++)
            {
    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
                _spi->dev->data_buf[i].val = c32;
    #else
                _spi->dev->data_buf[i] = c32;
    #endif
            }
        }

        // Issue pixels in blocks from temp buffer
        while (len)  // While pixels remain
        {
            xferLen = (bufLen <= len) ? bufLen : len;  // How many this pass?

            if (_miso != GFX_NOT_DEFINED)
            {
                l = (xferLen + 1) >> 1;
                for (uint32_t i = 0; i < l; i++)
                {
    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
                    _spi->dev->data_buf[i].val = c32;
    #else
                    _spi->dev->data_buf[i] = c32;
    #endif
                }
            }
            POLL((xferLen << 4) - 1);

            len -= xferLen;
        }
    }

    _data_buf_bit_idx = 0;
}

/**
 * @brief writePixels
 *
 * @param data
 * @param len
 */
void Arduino_ESP32SPI::writePixels(uint16_t *data, uint32_t len)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        while (len--)
        {
            write16(*data++);
        }
    }
    else  // 8-bit SPI
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        uint32_t l, l2;
        uint16_t p1, p2;
        while (len)
        {
            l  = (len > ESP32SPI_MAX_PIXELS_AT_ONCE) ? ESP32SPI_MAX_PIXELS_AT_ONCE : len;
            l2 = (l + 1) >> 1;
            for (uint32_t i = 0; i < l2; ++i)
            {
                p1 = *data++;
                p2 = *data++;
    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
                MSB_32_16_16_SET(_spi->dev->data_buf[i].val, p1, p2);
    #else
                MSB_32_16_16_SET(_spi->dev->data_buf[i], p1, p2);
    #endif
            }
            POLL((l << 4) - 1);

            len -= l;
        }
    }
}

/**
 * @brief writeBytes
 *
 * @param data
 * @param len
 */
void Arduino_ESP32SPI::writeBytes(uint8_t *data, uint32_t len)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        while (len--)
        {
            write(*data++);
        }
    }
    else  // 8-bit SPI
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        uint32_t  l, l4;
        uint32_t *p;
        while (len)
        {
            l  = (len > (ESP32SPI_MAX_PIXELS_AT_ONCE << 1)) ? (ESP32SPI_MAX_PIXELS_AT_ONCE << 1) : len;
            l4 = (l + 3) >> 2;
            p  = (uint32_t *)data;
            for (uint32_t i = 0; i < l4; ++i)
            {
    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
                _spi->dev->data_buf[i].val = *p++;
    #else
                _spi->dev->data_buf[i] = *p++;
    #endif
            }
            POLL((l << 3) - 1);

            len -= l;
            data += l;
        }
    }
}

/**
 * @brief writeIndexedPixels
 *
 * @param data
 * @param idx
 * @param len
 */
void Arduino_ESP32SPI::writeIndexedPixels(uint8_t *data, uint16_t *idx, uint32_t len)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        while (len--)
        {
            write16(idx[*data++]);
        }
    }
    else  // 8-bit SPI
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

        uint32_t l, l2;
        uint16_t p1, p2;
        while (len)
        {
            l  = (len > ESP32SPI_MAX_PIXELS_AT_ONCE) ? ESP32SPI_MAX_PIXELS_AT_ONCE : len;
            l2 = l >> 1;
            for (uint32_t i = 0; i < l2; ++i)
            {
                p1 = idx[*data++];
                p2 = idx[*data++];
    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
                MSB_32_16_16_SET(_spi->dev->data_buf[i].val, p1, p2);
    #else
                MSB_32_16_16_SET(_spi->dev->data_buf[i], p1, p2);
    #endif
            }
            if (l & 1)
            {
                p1 = idx[*data++];
    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
                MSB_16_SET(_spi->dev->data_buf[l - 1].val, p1);
    #else
                MSB_16_SET(_spi->dev->data_buf[l - 1], p1);
    #endif
            }
            POLL((l << 4) - 1);

            len -= l;
        }
    }
}

/**
 * @brief writeIndexedPixelsDouble
 *
 * @param data
 * @param idx
 * @param len
 */
void Arduino_ESP32SPI::writeIndexedPixelsDouble(uint8_t *data, uint16_t *idx, uint32_t len)
{
    if (_dc == GFX_NOT_DEFINED)  // 9-bit SPI
    {
        uint16_t hi, lo;
        while (len--)
        {
            _data16.value = idx[*data++];
            hi            = 0x100 | _data16.msb;
            lo            = 0x100 | _data16.lsb;
            WRITE9BIT(hi);
            WRITE9BIT(lo);
            WRITE9BIT(hi);
            WRITE9BIT(lo);
        }
    }
    else  // 8-bit SPI
    {
        if (_data_buf_bit_idx > 0)
        {
            flush_data_buf();
        }

