jurgen-kluft/rlcd/source/lib_display/cpp/databus/databus_ESP32SPI.cpp
        uint32_t l;
        uint16_t p;
        while (len)
        {
            l = (len > (ESP32SPI_MAX_PIXELS_AT_ONCE >> 1)) ? (ESP32SPI_MAX_PIXELS_AT_ONCE >> 1) : len;
            for (uint32_t i = 0; i < l; ++i)
            {
                p = idx[*data++];
    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
                MSB_32_16_16_SET(_spi->dev->data_buf[i].val, p, p);
    #else
                MSB_32_16_16_SET(_spi->dev->data_buf[i], p, p);
    #endif
            }
            POLL((l << 5) - 1);

            len -= l;
        }
    }
}

/**
 * @brief flush_data_buf
 *
 */
void Arduino_ESP32SPI::flush_data_buf()
{
    uint32_t len = (_data_buf_bit_idx + 31) / 32;
    for (uint32_t i = 0; i < len; i++)
    {
    #if CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5
        _spi->dev->data_buf[i].val = _buffer32[i];
    #else
        _spi->dev->data_buf[i] = _buffer32[i];
    #endif
    }
    POLL(_data_buf_bit_idx - 1);

    _data_buf_bit_idx = 0;
}

/**
 * @brief WRITE8BIT
 *
 * @param d
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32SPI::WRITE8BIT(uint8_t d)
{
    uint16_t idx = _data_buf_bit_idx >> 3;
    _buffer[idx] = d;
    _data_buf_bit_idx += 8;
    if (_data_buf_bit_idx >= (ESP32SPI_MAX_PIXELS_AT_ONCE << 4))
    {
        flush_data_buf();
    }
}

/**
 * @brief WRITE9BIT
 *
 * @param d
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32SPI::WRITE9BIT(uint32_t d)
{
    uint16_t idx   = _data_buf_bit_idx >> 3;
    uint8_t  shift = (_data_buf_bit_idx % 8);
    if (shift)
    {
        _buffer[idx++] |= d >> (shift + 1);
        _buffer[idx] = d << (7 - shift);
    }
    else
    {
        _buffer[idx++] = d >> 1;
        _buffer[idx]   = d << 7;
    }
    _data_buf_bit_idx += 9;
    if (_data_buf_bit_idx >= 504)  // 56 bytes * 9 bits
    {
        flush_data_buf();
    }
}

/******** low level bit twiddling **********/

/**
 * @brief DC_HIGH
 *
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32SPI::DC_HIGH(void) { *_dcPortSet = _dcPinMask; }

/**
 * @brief DC_LOW
 *
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32SPI::DC_LOW(void) { *_dcPortClr = _dcPinMask; }

/**
 * @brief CS_HIGH
 *
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32SPI::CS_HIGH(void)
{
    if (_cs != GFX_NOT_DEFINED)
    {
        *_csPortSet = _csPinMask;
    }
}

/**
 * @brief CS_LOW
 *
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32SPI::CS_LOW(void)
{
    if (_cs != GFX_NOT_DEFINED)
    {
        *_csPortClr = _csPinMask;
    }
}

/**
 * @brief POLL
 *
 * @return GFX_INLINE
 */
GFX_INLINE void Arduino_ESP32SPI::POLL(uint32_t len)
{
    #if (CONFIG_IDF_TARGET_ESP32)
    _spi->dev->mosi_dlen.usr_mosi_dbitlen = len;
    #elif (CONFIG_IDF_TARGET_ESP32S2)
    _spi->dev->mosi_dlen.usr_mosi_bit_len = len;
    #elif (CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5)
    _spi->dev->ms_dlen.ms_data_bitlen = len;
    #endif

    #if (CONFIG_IDF_TARGET_ESP32)
    _spi->dev->miso_dlen.usr_miso_dbitlen = 0;
    #elif (CONFIG_IDF_TARGET_ESP32S2)
    _spi->dev->miso_dlen.usr_miso_bit_len = 0;
    #endif

    #if !defined(CONFIG_IDF_TARGET_ESP32) && !defined(CONFIG_IDF_TARGET_ESP32S2)
    _spi->dev->cmd.update = 1;
    while (_spi->dev->cmd.update)
        ;
    #endif
    _spi->dev->cmd.usr = 1;
    while (_spi->dev->cmd.usr)
        ;
}

#endif  // #if defined(ESP32) && (CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C2 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 ||
        // CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5)
